// Hunt for HybridPetya random filenames and known file hashes
// Reference: https://www.bleepingcomputer.com/news/security/new-hybridpetya-ransomware-can-bypass-uefi-secure-boot/
DeviceEvents
| where SHA1 has_any ("9B0EE05FFFDA0B16CF9DAAC587CB92BB06D3981B", 
"3393A8C258239D6802553FD1CCE397E18FA285A1", "A6EBFA062270A321241439E8DF72664CD54EA1BC", "C7C270F9D3AE80EC5E8926A3CD1FB5C9D208F1DC", "C8E3F1BF0B67C83D2A6D9E594DE8067F0378E6C5", "CDC8CB3D211589202B49A48618B0D90C4D8F86FD", "D31F86BA572904192D7476CA376686E76E103D28") or SHA1 has_any (
"BD35908D5A5E9F7E41A61B7AB598AB9A88DB723D", "9DF922D00171AA3C31B75446D700EE567F8D787B",
"D0BD283133A80B47137562F2AAAB740FA15E6441")